<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft Office 2019 SKU-less installer package.

Set the REGION key to:

525133 for Americas Office 365 and Americas Volume LATEST (default)
532572 for Europe Office 365
532577 for Asia Office 365
871743 for Office 2016

Set the INSTALLERTYPE key to (this is for version only!):

o365 for Office 365 (default)
vl2019 for Office 2019
vl2016 for Office 2016

</string>
    <key>Identifier</key>
    <string>com.github.autopkg.office-recipes.download.Office2019Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2019Suite</string>
        <key>REGION</key>
        <string>525133</string>
        <key>INSTALLERTYPE</key>
        <string>o365</string>
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://go.microsoft.com/fwlink/?linkid=</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>OfficeSuiteSKULessVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>installertype</key>
                <string>%INSTALLERTYPE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL_BASE%%REGION%</string>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
