<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Office 2019 SKU-less installer package.

Set the REGION key to:

525133 for Office 365 and Americas Volume LATEST (default)
871743 for Office 2016

Due to the Downloads using Microsoft's Global CDN's the region code is now for type of installer

Set the INSTALLERTYPE key to (this is for version only!):

o365 for Office 365 (default)
vl2019 for Office 2019
vl2016 for Office 2016
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.office-recipes.munki.Office2019Suite</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.office-recipes.download.Office2019Suite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Office2019Suite</string>
		<key>REGION</key>
		<string>525133</string>
		<key>INSTALLERTYPE</key>
		<string>vl2019</string>
		<key>DOWNLOAD_URL_BASE</key>
		<string>https://go.microsoft.com/fwlink/?linkid=</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Office2019</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
					<string>Microsoft AutoUpdate</string>
					<string>Microsoft Outlook</string>
					<string>Microsoft Excel</string>
					<string>Microsoft PowerPoint</string>
					<string>Microsoft Word</string>
					<string>Microsoft OneNote</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
